brew "ack"
brew "xz"
brew "readline"
brew "direnv"
brew "openssl@3"
brew "ffmpeg"
brew "htop"
brew "latexindent"
brew "pipx"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tig"
brew "tree"
brew "zlib"
cask "arc"
cask "cursor"
cask "discord"
cask "iterm2"
cask "ledger-live"
cask "mactex"
cask "obs"
cask "steam"
cask "sublime-text"
cask "telegram"
cask "vlc"
cask "zoom"
vscode "anysphere.cursorpyright"
vscode "eamodio.gitlens"
vscode "james-yu.latex-workshop"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
