tap "anthropics/tap"
tap "coderabbitai/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# Library for command-line editing
brew "readline"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Improved top (interactive process viewer)
brew "htop"
# Add indentation to LaTeX files
brew "latexindent"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# VPN client
cask "amneziavpn"
# CLI for the Claude Platform
cask "anthropics/tap/ant", trusted: true
# Chromium based browser
cask "arc"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Voice and text chat software
cask "discord"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-wallet"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Open-source software for live streaming and screen recording
cask "obs"
# Email client
cask "readdle-spark"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
vscode "eamodio.gitlens"
vscode "james-yu.latex-workshop"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "xaver.clang-format"
uv "black"
uv "llm"
